STATELESS TF PLAN OUT

Terraform will perform the following actions:

  # module.stateless.module.jenkins.aws_autoscaling_group.main will be created
  + resource "aws_autoscaling_group" "main" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_elb_capacity          = 1
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-0f826c3873dd1bd26",
        ]
      + wait_for_capacity_timeout = "10m"
      + wait_for_elb_capacity     = 1

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "mgmt-test"
        }
      + tag {
          + key                 = "Layer"
          + propagate_at_launch = true
          + value               = "app"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "bfd-mgmt-test-jenkins"
        }
      + tag {
          + key                 = "application"
          + propagate_at_launch = true
          + value               = "bfd"
        }
      + tag {
          + key                 = "business"
          + propagate_at_launch = true
          + value               = "oeda"
        }
      + tag {
          + key                 = "role"
          + propagate_at_launch = true
          + value               = "jenkins"
        }
      + tag {
          + key                 = "stack"
          + propagate_at_launch = true
          + value               = "mgmt"
        }
    }

  # module.stateless.module.jenkins.aws_iam_group_membership.managed_service_group will be created
  + resource "aws_iam_group_membership" "managed_service_group" {
      + group = "managed-service"
      + id    = (known after apply)
      + name  = "managed-service-group-membership"
      + users = [
          + "VZG9",
        ]
    }

  # module.stateless.module.jenkins.aws_iam_instance_profile.jenkins_profile will be created
  + resource "aws_iam_instance_profile" "jenkins_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "bfd-jenkins"
      + path        = "/"
      + role        = "bfd-mgmt-jenkins"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.stateless.module.jenkins.aws_iam_policy.jenkins_boundary will be created
  + resource "aws_iam_policy" "jenkins_boundary" {
      + arn         = (known after apply)
      + description = "Jenkins Permission Boundary Policy"
      + id          = (known after apply)
      + name        = "bfd-jenkins-permission-boundary"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:List*",
                          + "rds:*",
                          + "ec2:Reset*",
                          + "logs:*",
                          + "cloudtrail:GetTrailStatus",
                          + "kms:Get*",
                          + "dynamodb:*",
                          + "autoscaling:*",
                          + "kms:ReEncrypt*",
                          + "iam:GetPolicy*",
                          + "rds:Describe*",
                          + "ec2:DeleteNetworkAcl*",
                          + "cloudtrail:ListTags",
                          + "iam:GetServiceLastAccessed*",
                          + "config:*",
                          + "events:*",
                          + "ec2:Associate*",
                          + "sns:*",
                          + "iam:GetRole",
                          + "cloudtrail:LookupEvents",
                          + "iam:GetGroup*",
                          + "kms:Describe*",
                          + "ec2:Cancel*",
                          + "cloudtrail:DescribeTrails",
                          + "iam:*",
                          + "cloudwatch:*",
                          + "ec2:Modify*",
                          + "ec2:*",
                          + "iam:GetAccount*",
                          + "ec2:AssignPrivateIpAddresses*",
                          + "iam:GetUser*",
                          + "ec2:Request*",
                          + "iam:ListAttached*",
                          + "cloudtrail:GetEventSelectors",
                          + "iam:PassRole",
                          + "ses:*",
                          + "kms:*",
                          + "ec2:Import*",
                          + "ec2:Release*",
                          + "iam:GetRole*",
                          + "ec2:Purchase*",
                          + "ec2:Bundle*",
                          + "elasticfilesystem:*",
                          + "s3:*",
                          + "ec2:Copy*",
                          + "ec2:Replace*",
                          + "iam:ListRoles",
                          + "sts:*",
                          + "elasticloadbalancing:*",
                          + "iam:Simulate*",
                          + "ec2:Describe*",
                          + "cloudtrail:ListPublicKeys",
                          + "route53:*",
                          + "iam:GetContextKeys*",
                          + "ec2:Allocate*",
                          + "iam:Upload*",
                          + "waf-regional:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "JenkinsPermissionBoundary"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.stateless.module.jenkins.aws_iam_policy.jenkins_volume will be created
  + resource "aws_iam_policy" "jenkins_volume" {
      + arn         = (known after apply)
      + description = "Jenkins Data Volume Policy"
      + id          = (known after apply)
      + name        = "bfd-jenkins-volume"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:AttachVolume"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:instance/*",
                          + "arn:aws:ec2:*:*:volume/*",
                        ]
                    },
                  + {
                      + Action   = "ec2:DescribeVolumes"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.stateless.module.jenkins.aws_iam_policy_attachment.jenkins_policy_boundary will be created
  + resource "aws_iam_policy_attachment" "jenkins_policy_boundary" {
      + groups     = [
          + "managed-service",
        ]
      + id         = (known after apply)
      + name       = "bfd-jenkins-permission-boundary"
      + policy_arn = (known after apply)
    }

  # module.stateless.module.jenkins.aws_iam_role.jenkins will be created
  + resource "aws_iam_role" "jenkins" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bfd-mgmt-jenkins"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.stateless.module.jenkins.aws_iam_role_policy_attachment.jenkins_volume will be created
  + resource "aws_iam_role_policy_attachment" "jenkins_volume" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "bfd-mgmt-jenkins"
    }

  # module.stateless.module.jenkins.aws_launch_configuration.main will be created
  + resource "aws_launch_configuration" "main" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + iam_instance_profile        = "bfd-jenkins"
      + id                          = (known after apply)
      + image_id                    = "ami-08d9f94f51d962ca9"
      + instance_type               = "c5.xlarge"
      + key_name                    = "bfd-jenkins"
      + name                        = (known after apply)
      + name_prefix                 = "bfd-mgmt-test-jenkins-"
      + placement_tenancy           = "default"
      + security_groups             = (known after apply)
      + user_data                   = "593c4d106c74136ba8a82f8e01e3126e9bc85140"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.stateless.module.jenkins.aws_security_group.base will be created
  + resource "aws_security_group" "base" {
      + arn                    = (known after apply)
      + description            = "Allow CI access to app servers"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.252.40.0/21",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "bfd-mgmt-test-jenkins-base"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "mgmt-test"
          + "Layer"       = "app"
          + "Name"        = "bfd-mgmt-test-jenkins-base"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "role"        = "jenkins"
          + "stack"       = "mgmt"
        }
      + vpc_id                 = "vpc-07ea3c4952951d2b3"
    }

  # module.stateless.module.jenkins.aws_security_group.packer_sg will be created
  + resource "aws_security_group" "packer_sg" {
      + arn                    = (known after apply)
      + description            = "Allow traffic to Packer Instances"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.252.40.0/21",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-06960a80f8fb47a15",
                  + "sg-0c30ebdf54c0e21a9",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "packer_sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "packer_sg"
        }
      + vpc_id                 = "vpc-07ea3c4952951d2b3"
    }

  # module.stateless.module.jenkins_lb.aws_elb.main will be created
  + resource "aws_elb" "main" {
      + arn                         = (known after apply)
      + availability_zones          = (known after apply)
      + connection_draining         = true
      + connection_draining_timeout = 60
      + cross_zone_load_balancing   = false
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 60
      + instances                   = (known after apply)
      + internal                    = true
      + name                        = "bfd-mgmt-test-jenkins"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = [
          + "subnet-03fc8d160e207b859",
        ]
      + tags                        = {
          + "Environment" = "mgmt-test"
          + "Layer"       = "dmz"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "role"        = "jenkins"
          + "stack"       = "mgmt"
        }
      + zone_id                     = (known after apply)

      + access_logs {
          + bucket        = "bfd-mgmt-test-admin-577373831711"
          + bucket_prefix = "jenkins_elb_access_logs"
          + enabled       = false
          + interval      = 5
        }

      + health_check {
          + healthy_threshold   = 5
          + interval            = 10
          + target              = "TCP:443"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 443
          + instance_protocol = "TCP"
          + lb_port           = 443
          + lb_protocol       = "TCP"
        }
    }

  # module.stateless.module.jenkins_lb.aws_s3_bucket_policy.logs will be created
  + resource "aws_s3_bucket_policy" "logs" {
      + bucket = "bfd-mgmt-test-admin-577373831711"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Id        = "LBAccessLogs"
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::127311923021:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::bfd-mgmt-test-admin-577373831711/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.stateless.module.jenkins_lb.aws_security_group.lb will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "Allow access to the jenkins load-balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.252.40.0/21",
                ]
              + description      = "To VPC instances"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.252.40.0/21",
                ]
              + description      = "From Self"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "bfd-mgmt-test-jenkins-lb"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "mgmt-test"
          + "Layer"       = "dmz"
          + "Name"        = "bfd-mgmt-test-jenkins-lb"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "role"        = "jenkins"
          + "stack"       = "mgmt"
        }
      + vpc_id                 = "vpc-07ea3c4952951d2b3"
    }

Plan: 14 to add, 0 to change, 0 to destroy.